mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
/* #################################################################################################
 *
 *  Function: ESP32_S0 Module for SCDE (Smart Connected Device Engine)
 *
 *  ESP 8266EX & ESP32 SOC Activities ...
 *  Copyright by EcSUHA
 *
 *  Created by Maik Schulze, Sandfuhren 4, 38448 Wolfsburg, Germany for EcSUHA.de 
 *
 *  MSchulze780@GMAIL.COM
 *  EcSUHA - ECONOMIC SURVEILLANCE AND HOME AUTOMATION - WWW.EcSUHA.DE
 * #################################################################################################
 */

/*
USAGE for S0 Counter, counting when low:
define S0.1.at.GPIO.16 esp32_S0 Pulse_CH0_GPIO=16&UNIT=0&CH0_POS_MODE=no_effect&CH0_NEG_MODE=inc_counter&CH0_HCTRL_MODE=no_modification&CH0_LCTRL_MODE=no_modification&THR_L_LIM_EN=Disabled&THR_H_LIM_EN=Disabled&THR_ZERO_EN=Disabled&THR_THRES0_EN=Disabled&THR_THRES1_EN=Disabled&FILTER_EN=Enabled&FILTER_THRES=500
define S0.1.at.GPIO.16 FILTER_THRES=5000
set myS0 CH1_POS_MODE=no_effect
set myS0 CH1_NEG_MODE=inc_counter
set myS0 CH1_HCTRL_MODE=no_modification
set myS0 CH1_LCTRL_MODE=no_modification
*/


/* DONT FORGET THE PAUSE BIT & START COUNTING BIT!!!

  uint32_t *pX_REG =
	(uint32_t*) 0x3FF570B0;

  // config counter -> NOT paused + NOT in reset state
  *pX_REG &= (~(0b11<<(ESP32_S0_Definition->unit * 2)));

*/

#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>

#include <SCDE_s.h>

#include "ESP32_S0_Module.h"

#include "SCDE_Main.h"



// we are using the hardware counter
#include "soc/pcnt_reg.h"
#include "soc/pcnt_struct.h"


#include "driver/gpio.h"






//???
#include "driver/periph_ctrl.h"
#include "driver/gpio.h"
//#include "driver/pcnt.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "soc/gpio_sig_map.h"




// -------------------------------------------------------------------------------------------------

// ammount of debug information 0 = off 5 max?
#ifndef ESP32_S0_DBG
#define ESP32_S0_DBG 0
#endif

// -------------------------------------------------------------------------------------------------

// make data root locally available
static SCDERoot_t* SCDERoot;

// make locally available from data-root: the SCDEFn (Functions / callbacks) for operation
static SCDEFn_t* SCDEFn;

// -------------------------------------------------------------------------------------------------

#include <WebIf_EspFSStdFileTX.h>
#include <WebIf_EspFSAdvFileTX.h>

#include "HTools_cgi.h"
#include <ServAPCfg_tpl.h>
#include <CGI_Redirect.h>



// -------------------------------------------------------------------------------------------------

 

/*
 * Implemented Values for Keys
 */

// ESP32_S0_SET_THR_THRES1_EN -> 'THR_THRES1_EN' -> DIS/ENA
// ESP32_S0_SET_THR_THRES0_EN -> 'THR_THRES0_EN' -> DIS/ENA
// ESP32_S0_SET_THR_L_LIM_EN -> 'THR_L_LIM_EN' -> DIS/ENA
// ESP32_S0_SET_THR_H_LIM_EN -> 'THR_H_LIM_EN' -> DIS/ENA
// ESP32_S0_SET_THR_ZERO_EN -> 'THR_ZERO_EN' -> DIS/ENA
// ESP32_S0_SET_FILTER_EN -> 'FILTER_EN' -> DIS/ENA
SelectAData ESP32_S0_DisEna[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Disabled"},
  {1,"Enabled"}, 
  {0, NULL}
  };

// values for KEY-GROUP 'CTRL_MODE'
// ESP32_S0_SET_CH1_LCTRL_MODE -> 'CH1_LCTRL_MODE'
// ESP32_S0_SET_CH1_HCTRL_MODE -> 'CH1_HCTRL_MODE'
// ESP32_S0_SET_CH0_LCTRL_MODE -> 'CH0_LCTRL_MODE'
// ESP32_S0_SET_CH0_HCTRL_MODE -> 'CH0_HCTRL_MODE'
SelectAData ESP32_S0_CTRL_MODE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"no_modification"},
  {1,"invert"},
  {2,"inhibit_modification"},
  {0, NULL}
  };

// Values for KEY-GROUP 'ESP32_S0_CH_MODE'
// ESP32_S0_SET_CH1_POS_MODE -> 'CH1_POS_MODE' 1: Increase the counter; 2: Decrease the counter; 0, 3: No effect on counter
// ESP32_S0_SET_CH1_NEG_MODE -> 'CH1_NEG_MODE'
// ESP32_S0_SET_CH0_POS_MODE -> 'CH0_POS_MODE'
// ESP32_S0_SET_CH0_NEG_MODE -> 'CH0_NEG_MODE'
SelectAData ESP32_S0_CH_MODE[]= {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"no_effect"},
  {1,"inc_counter"},
  {2,"dec_counter"},
  {0, NULL}
  };



/**
 * For Type: ESP32_S0
 * Implemented-Args-Keys, for input (MAX 64!). //IAK!!
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in ESP32_S0_parsedKVInput_t
 */
enum ESP32_S0_SET_IK {				// Bit #XX for debugging

// S0 calculation configuration
    ESP32_S0_SET_IK_ATT		= 0		// Bit #00 'att' -> 

  , ESP32_S0_SET_IK_AVU				// Bit #01 'avu' -> 
  , ESP32_S0_SET_IK_AVF				// Bit #02 'avf' -> 

  , ESP32_S0_SET_IK_ATU				// Bit #03 'atu' -> 
  , ESP32_S0_SET_IK_ATF				// Bit #04 'atf' -> 

  , ESP32_S0_SET_IK_DEB				// Bit #05 'deb' -> 
  , ESP32_S0_SET_IK_NAME			// Bit #06 'name' -> 
  , ESP32_S0_SET_IK_CAPS			// Bit #07 'caps' -> #atv fehlt!

  // Block #01 HW counter, general configuration
  , ESP32_S0_SET_PULSE_CH0_GPIO			// Bit #08 'PULSE_CH0_GPIO' -> 
  , ESP32_S0_SET_CONTROL_CH0_GPIO		// Bit #09 'CONTROL_CH0_GPIO' -> 
  , ESP32_S0_SET_PULSE_CH1_GPIO			// Bit #10 'PULSE_CH1_GPIO' -> 
  , ESP32_S0_SET_CONTROL_CH1_GPIO		// Bit #11 'CONTROL_CH1_GPIO' -> 
  , ESP32_S0_SET_UNIT				// Bit #12 'UNIT' -> decval 0-7

  // Block #02 HW-counter, detail configuration
  , ESP32_S0_SET_CH1_LCTRL_MODE			// Bit #13 'CH1_LCTRL_MODE' -> no_mod/invert/inh_mod
  , ESP32_S0_SET_CH1_HCTRL_MODE			// Bit #14 'CH1_HCTRL_MODE' -> no_mod/invert/inh_mod
  , ESP32_S0_SET_CH1_POS_MODE			// Bit #15 'CH1_POS_MODE' -> inc/dec/inh_mod
  , ESP32_S0_SET_CH1_NEG_MODE			// Bit #16 'CH1_NEG_MODE' -> inc/dec/inh_mod
  , ESP32_S0_SET_CH0_LCTRL_MODE			// Bit #17 'CH0_LCTRL_MODE' -> no_mod/invert/inh_mod
  , ESP32_S0_SET_CH0_HCTRL_MODE			// Bit #18 'CH0_HCTRL_MODE' -> no_mod/invert/inh_mod
  , ESP32_S0_SET_CH0_POS_MODE			// Bit #19 'CH0_POS_MODE' -> inc/dec/inh_mod
  , ESP32_S0_SET_CH0_NEG_MODE			// Bit #20 'CH0_NEG_MODE' -> inc/dec/inh_mod
  , ESP32_S0_SET_THR_THRES1_EN			// Bit #21 'THR_THRES1_EN' -> DIS/ENA
  , ESP32_S0_SET_THR_THRES0_EN			// Bit #22 'THR_THRES0_EN' -> DIS/ENA
  , ESP32_S0_SET_THR_L_LIM_EN			// Bit #23 'THR_L_LIM_EN' -> DIS/ENA
  , ESP32_S0_SET_THR_H_LIM_EN			// Bit #24 'THR_H_LIM_EN' -> DIS/ENA
  , ESP32_S0_SET_THR_ZERO_EN			// Bit #25 'THR_ZERO_EN' -> DIS/ENA
  , ESP32_S0_SET_FILTER_EN			// Bit #26 'FILTER_EN' -> DIS/ENA
  , ESP32_S0_SET_FILTER_THRES			// Bit #27 'FILTER_THRES' -> decval 10 bit zahl
  , ESP32_S0_SET_CNT_THRES1			// Bit #28 'CNT_THRES1' -> decval 16 bit zahl
  , ESP32_S0_SET_CNT_THRES0			// Bit #29 'CNT_THRES0' -> decval 16 bit zahl
  , ESP32_S0_SET_CNT_L_LIM			// Bit #30 'CNT_L_LIM' -> decval 10 bit zahl
  , ESP32_S0_SET_CNT_H_LIM			// Bit #31 'CNT_H_LIM' -> decval 10 bit zahl

// end marker
  , ESP32_S0_SET_IK_Number_of_keys		// Bit #32 MAX 64 IMPLEMENTED !

