mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
};



/**
 * For Type: ESP32_S0
 * Implemented readings (MAX 32!)
 * Can be assigned to Implemented Keys, if affected
 */
enum ESP32_S0_Readings {			// Bit #XX for debugging

   ESP32_S0_R_ATT		= (1<<0)	// Bit #00 'att'  -> 

  ,ESP32_S0_R_ATV		= (1<<1)	// Bit #01 'atv' -> 

  ,ESP32_S0_R_AV01_AV05_AV15	= (1<<2)	// Bit #02 'av01'  -> 

  ,ESP32_S0_R_AVF		= (1<<3)	// Bit #03 'avf' -> 

  ,ESP32_S0_R_AVU		= (1<<4)	// Bit #04 'avu'  -> 

  ,ESP32_S0_R_ATF		= (1<<5)	// Bit #05 'atf' -> 

  ,ESP32_S0_R_ATU		= (1<<6)	// Bit #06 'atu' -> 

  ,ESP32_S0_R_DEB		= (1<<7)	// Bit #07 'deb' -> 

  ,ESP32_S0_R_NAME		= (1<<8)	// Bit #08 'name' + caps + ufid -> 

};



/**
 * For Type: ESP32_S0
 * Implemented KEYS and assigned readings for this query - analyzed by by http_parser_parse_url()

 * Num should meet enum XX_QueryFields
 * Result is stored in struct SCDE_XX_parsedKVInput
 */
kvParseImplementedKeys_t ESP32_S0_Set_ImplementedKeys[] = {
// |                                                          affected readings										              	|  CMD

// S0 calculation configuration
   { ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB			, "att" }		// #00

  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB			, "avu" }		// #01
  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB			, "avf" }		// #02

  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB			, "atu" }		// #03
  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB			, "atf" }		// #04

  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB			, "deb" }		// #05
  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB | ESP32_S0_R_NAME	, "name" }		// #06
  ,{ ESP32_S0_R_ATT | ESP32_S0_R_ATV | ESP32_S0_R_AV01_AV05_AV15 | ESP32_S0_R_AVF | ESP32_S0_R_AVU | ESP32_S0_R_ATF | ESP32_S0_R_ATU | ESP32_S0_R_DEB | ESP32_S0_R_NAME	, "caps" }		// #07

// S0 counter configuration  
  ,{ 0																					, "Pulse_CH0_GPIO" }	// #08
  ,{ 0																					, "Control_CH0_GPIO" }	// #09
  ,{ 0																					, "Pulse_CH1_GPIO" }	// #10
  ,{ 0																					, "Control_CH1_GPIO" }	// #11
  ,{ 0																					, "Unit" }		// #12
  ,{ 0																					, "CH1_LCTRL_MODE" }	// #13
  ,{ 0																					, "CH1_HCTRL_MODE" }	// #14
  ,{ 0																					, "CH1_POS_MODE" }	// #15
  ,{ 0																					, "CH1_NEG_MODE" }	// #16
  ,{ 0																					, "CH0_LCTRL_MODE" }	// #17
  ,{ 0																					, "CH0_HCTRL_MODE" }	// #18
  ,{ 0																					, "CH0_POS_MODE" }	// #19
  ,{ 0																					, "CH0_NEG_MODE" }	// #20
  ,{ 0																					, "THR_THRES1_EN" }	// #21
  ,{ 0																					, "THR_THRES0_EN" }	// #22
  ,{ 0																					, "THR_L_LIM_EN" }	// #23
  ,{ 0																					, "THR_H_LIM_EN" }	// #24
  ,{ 0																					, "THR_ZERO_EN" }	// #25
  ,{ 0																					, "FILTER_EN" }		// #26
  ,{ 0																					, "FILTER_THRES" }	// #27
  ,{ 0																					, "CNT_THRES1" }	// #28
  ,{ 0																					, "CNT_THRES0" }	// #29
  ,{ 0																					, "CNT_L_LIM" }		// #30
  ,{ 0																					, "CNT_H_LIM" }		// #31

}; // number of elements should be equal with XX_SET_IK_Number_of_keys, LIMIT IS 64 ELEMENTS !





/*"WSAP_Password ";
	$list .= "WSAP_RF_Channel:uzsuSelectRadio,1,2,3,4,5,6,7,8,9,10,11,12,13 ";

"WSAP_Beacon_Interval:slider,100,10,60000 ";

uint8Slider,a,b,c

uint16Slider,a,b,c
uint32Slider,a,b,c
int8Slider,a,b,c
int16Slider,a,b,c
int32Slider,a,b,c

*/



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_S0_ActiveResourcesDataA_forWebIf
 *  Desc: Resource-Content-structure of active Directory - PART A (Resource-Data-Row)
 *  Data: WebIf_ActiveResourcesDataA_t[X] from HttpD.h
 * -------------------------------------------------------------------------------------------------
 */
// Content:   AllowedMethodBF          | AllowedDocMimeBF  | AllowedSchemeBF |free|CgiNo| EnaByBit | Url
const WebIf_ActiveResourcesDataA_t ESP32_S0_ActiveResourcesDataA_forWebIf[] = {  //ICACHE_RODATA_ATTR = 

  // SOC Hardware Cfg
  { 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  0, 0b00000000, "/SoCHWCfg"}

  // WiFi Stations Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  1, 0b00000000, "/WiFi/StationCfg"}

  // WIFI Q-Connect PAGES
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0,  2, 0b00000000, "/WiFi/QConnect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000001000, 0b0000000000000001,  0,  3, 0b00000000, "/WiFi/WiFiScan"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  4, 0b00000000, "/WiFi/Connect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  5, 0b00000000, "/WiFi/Setmode"}

  // Service Access Point Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  6, 0b00000000, "/WiFi/ServAPCfg"}

  // TimeStamp Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  7, 0b00000000, "/TiStCfg"}

  // Firmware Update
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  8, 0b00000000, "/Firmware"}

  // Redirects
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0, 10, 0b00000000, "/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0, 10, 0b00000000, "/index"}	// .htm

