mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
	// valid input happened ?
	if (SCDEH_GetDecUInt8Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_UNIT].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_UNIT].len, &newUnit) 
		&& (newUnit <= 7) ) {

/*

		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;


		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");


*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // block #2 get current assigned / connected GPIO for pulse input channel 0
  uint8_t newPulseCH0GPIO = ESP32_S0_Definition->pulseCH0GPIO;

  // block #3 get current assigned / connected GPIO for control input channel 0
  uint8_t newControlCH0GPIO = ESP32_S0_Definition->controlCH0GPIO;

  // block #4 get current assigned / connected GPIO for pulse input channel 1
  uint8_t newPulseCH1GPIO = ESP32_S0_Definition->pulseCH1GPIO;

  // block #5 get current assigned / connected GPIO for control input channel 1
  uint8_t newControlCH1GPIO = ESP32_S0_Definition->controlCH1GPIO;

  // block #6 get current ESP32 counter configuration registers from selected unit
  // this stores temp values
  ESP32_S0_CNT_CONF_REG_t newS0_CNT_CONF_REG;
  // pointer to make hardware counters accessible
  ESP32_S0_CNT_CONF_REG_t *pS0_CNT_CONF_REG =
	(ESP32_S0_CNT_CONF_REG_t*) (0x3FF57000 + (0x0c * newUnit));
  memcpy(&newS0_CNT_CONF_REG, &pS0_CNT_CONF_REG, sizeof(ESP32_S0_CNT_CONF_REG_t));
// clear befehl implementieren?
// memset(&ESP32_S0_CNT_CONF_REG, 0, sizeof(ESP32_S0_CNT_CONF_REG_t));

// ------------------------------------------------------------------------------------------------

// 2. Step: Process the possible input keys

  // att=[0-9] -> Setze Allzeit-Gesamt-Impulse passend zum aktuellen Zählerstand
  // att=[0-9] -> Set alltime-total-tics meeting the currend meter-reading
/*
  if (QueryResultKF->KeyField_Set == (uint64_t) 1 << S0_QF_att)

	{

	uint32_t NewVal;

	// valid input happened ?
	if (SCDEH_GetDecUInt32Val((uint8*)Args+QueryResultKF->KeyField_Data_t[S0_QF_att].off
		,QueryResultKF->KeyField_Data_t[S0_QF_att].len, &NewVal))

		{

		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

		}

	}

//>Caps Bit 1,2,3,4,5,6-----------------------------------------------------------------------------

  // avu=[a-zA-Z0-9_.] -> Setze Einheit für den Durchschnitts-Verbrauchs-Wert (char[3])
  // avu=[a-zA-Z0-9_.] -> Set unit for average-consumption-value (char[3])

  else if (QueryResultKF->KeyField_Set == (uint64_t) 1 << S0_QF_avu)

	{

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal((uint8_t*)Args+QueryResultKF->KeyField_Data_t[S0_QF_avu].off
		,QueryResultKF->KeyField_Data_t[S0_QF_avu].len
		,(char*) &SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AverageUnit
		,sizeof (SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AverageUnit)
		,3) ) // -> case 3 = (Alpha+Num+"³") for Unit Name

		{	

		// SAVE Value
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_avu].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=avu");

		}

	}

//>Caps Bit 1---------------------------------------------------------------------------------------

  // avf=[0-9.] -> Setze Durchschnittsverbrauch Berechnungsfaktor (float)
  // avf=[0-9.] -> Set average consumption calculation factor (float)

  else if (QueryResultKF->KeyField_Set == (uint64_t) 1 << S0_QF_avf)

	{

	double NewVal;

	// valid input happened ?
	if (SCDEH_GetFloatVal((uint8*)Args+QueryResultKF->KeyField_Data_t[S0_QF_avf].off
		,QueryResultKF->KeyField_Data_t[S0_QF_avf].len, &NewVal))

		{

		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AverageFactor
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_avf].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=avf");

		}

	}

//--------------------------------------------------------------------------------------------------

  // atu=[a-zA-Z0-9_.] -> Setze Einheit für den Allzeit-Gesamt-Wert (char[3])
  // atu=[a-zA-Z0-9_.] -> Set unit for alltime-total-value (char[3])

  else if (QueryResultKF->KeyField_Set == (uint64_t) 1 << S0_QF_atu)

	{

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal((uint8_t*)Args+QueryResultKF->KeyField_Data_t[S0_QF_atu].off
		,QueryResultKF->KeyField_Data_t[S0_QF_atu].len
		,(char*) &SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalUnit
		,sizeof (SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalUnit)
		,3) ) // -> case 3 = (Alpha+Num+"³") for Unit Name

		{	

		// SAVE Value
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_atu].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=atu");

