mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // THR_ZERO_EN=Disabled|Enabled
  // -> ?? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ?? Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_THR_ZERO_EN) ) {

	uint8_t NewMode;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_THR_ZERO_EN].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_THR_ZERO_EN].len, &NewMode, ESP32_S0_DisEna) ) {

		// store ne value
		newS0_CNT_CONF_REG.CNT_THR_ZERO_EN = NewMode;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // FILTER_EN=Disabled|Enabled
  // -> ?? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ?? Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_FILTER_EN) ) {

	uint8_t NewMode;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_FILTER_EN].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_FILTER_EN].len, &NewMode, ESP32_S0_DisEna) ) {

		// store ne value
		newS0_CNT_CONF_REG.CNT_FILTER_EN = NewMode;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // FILTER_THRES=[0-9]
  // -> ??? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ???  Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_FILTER_THRES) ) {

	uint16_t NewVal;

	// valid input happened ?

	if (SCDEH_GetDecUInt16Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_FILTER_THRES].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_FILTER_THRES].len, &NewVal) ) {

		// store ne value
		newS0_CNT_CONF_REG.CNT_FILTER_THRES = NewVal;
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // CNT_THRES1=[0-9]
  // -> ??? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ???  Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_CNT_THRES1) ) {

	uint16_t NewVal;

	// valid input happened ?

	if (SCDEH_GetDecUInt16Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_CNT_THRES1].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_CNT_THRES1].len, &NewVal) ) {

		// store ne value
		newS0_CNT_CONF_REG.CNT_CNT_THRES1 = NewVal;
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // CNT_THRES0=[0-9] 
  // -> ??? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ???  Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_CNT_THRES0) ) {

	uint16_t NewVal;

	// valid input happened ?
	if (SCDEH_GetDecUInt16Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_CNT_THRES0].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_CNT_THRES0].len, &NewVal) ) {
		// store ne value
		newS0_CNT_CONF_REG.CNT_CNT_THRES0 = NewVal;
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

