mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // CNT_L_LIM=[0-9]
  // -> ??? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ???  Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_CNT_L_LIM) ) {

	uint16_t NewVal;

	// valid input happened ?
	if (SCDEH_GetDecUInt16Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_CNT_L_LIM].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_CNT_L_LIM].len, &NewVal) ) {
		// store ne value
		newS0_CNT_CONF_REG.CNT_CNT_L_LIM = NewVal;
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

  // CNT_H_LIM=[0-9]
  // -> ??? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ???  Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_S0_SET_CNT_H_LIM) ) {

	uint16_t NewVal;

	// valid input happened ?
	if (SCDEH_GetDecUInt16Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_S0_SET_CNT_H_LIM].off
		,parsedKVInput->keyData_t[ESP32_S0_SET_CNT_H_LIM].len, &NewVal) ) {
		// store ne value
		newS0_CNT_CONF_REG.CNT_CNT_H_LIM = NewVal;
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

//> ------------------------------------------------------------------------------------------------

// 3. Step: Check if the ammount of input elements meets our criteria

  // check if all required Key=Value components are included -> return with FALSE
  if ( (parsedKVInput->keysFoundBF & parsedKVInput->requiredKVBF) != parsedKVInput->requiredKVBF) {

	#if ESP32_S0_DBG >= 5
	printf("|requiredKVBF, no match!>");	
  	#endif

	return true;
  }

  // check if forbidden Key=Value components are included -> return with FALSE
  if (parsedKVInput->keysFoundBF & parsedKVInput->forbiddenKVBF) {

	#if ESP32_S0_DBG >= 5
	printf("|forbiddenKVBF, match!>");	
  	#endif

	return true;
  }

//> ------------------------------------------------------------------------------------------------

// 4. Step: Passed. Store the new values

  // block #1 store counter unit
  if (parsedKVInput->keysFoundBF | ( (1 << ESP32_S0_SET_UNIT) ) ) {

	#if ESP32_S0_DBG >= 5
	printf("|W B#01 Unit=%d>"
		,newUnit);	
  	#endif

	// store counter unit
	ESP32_S0_Definition->unit = newUnit;
  }

  // block #2 store assigned / connected pulse GPIO channel 0
  if (parsedKVInput->keysFoundBF | ( (1 << ESP32_S0_SET_PULSE_CH0_GPIO) ) ) {

	#if ESP32_S0_DBG >= 5
	printf("|W B#02 Pulse_CH0_GPIO=%d>"
		,newPulseCH0GPIO);	
  	#endif

	// store assigned pulse GPIO channel 0
	ESP32_S0_Definition->pulseCH0GPIO = newPulseCH0GPIO;

	// setup the GPIO and connect the matrix
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[newPulseCH0GPIO], PIN_FUNC_GPIO);

        gpio_set_direction(newPulseCH0GPIO, GPIO_MODE_INPUT);

        gpio_set_pull_mode(newPulseCH0GPIO, GPIO_PULLUP_ONLY);

         gpio_matrix_in(newPulseCH0GPIO
		,PCNT_SIG_CH0_IN0_IDX + 4 * newUnit
		,0);
  }

  // block #3 store assigned / connected control GPIO channel 0
  if (parsedKVInput->keysFoundBF | ( (1 << ESP32_S0_SET_CONTROL_CH0_GPIO) ) ) {

	#if ESP32_S0_DBG >= 5
	printf("|W B#03 Control_CH0_GPIO=%d>"
		,newControlCH0GPIO);	
  	#endif

	// store assigned control GPIO channel 0
	ESP32_S0_Definition->controlCH0GPIO = newControlCH0GPIO;

	// setup the GPIO and connect the matrix
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[newControlCH0GPIO], PIN_FUNC_GPIO);

        gpio_set_direction(newControlCH0GPIO, GPIO_MODE_INPUT);

        gpio_set_pull_mode(newControlCH0GPIO, GPIO_PULLUP_ONLY);

        gpio_matrix_in(newControlCH0GPIO
		,PCNT_CTRL_CH0_IN0_IDX + 4 * newUnit
		,0);
  }

  // block #4 store assigned / connected pulse GPIO channel 1
  if (parsedKVInput->keysFoundBF | ( (1 << ESP32_S0_SET_PULSE_CH1_GPIO) ) ) {

	#if ESP32_S0_DBG >= 5
	printf("|W B#04 Pulse_CH1_GPIO=%d>"
		,newPulseCH1GPIO);	
  	#endif

	// store assigned pulse GPIO channel 1
	ESP32_S0_Definition->pulseCH1GPIO = newPulseCH1GPIO;

	// setup the GPIO and connect the matrix
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[newPulseCH1GPIO], PIN_FUNC_GPIO);

        gpio_set_direction(newPulseCH1GPIO, GPIO_MODE_INPUT);

