mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
        gpio_set_pull_mode(newPulseCH1GPIO, GPIO_PULLUP_ONLY);

	gpio_matrix_in(newPulseCH1GPIO
		,PCNT_SIG_CH1_IN0_IDX + 4 * newUnit
		,0);
  }

  // block #5 store assigned / connected control GPIO channel 1
  if (parsedKVInput->keysFoundBF | ( (1 << ESP32_S0_SET_CONTROL_CH1_GPIO) ) ) {

	#if ESP32_S0_DBG >= 5
	printf("|W B#05 Control_CH1_GPIO=%d>"
		,newControlCH1GPIO);	
  	#endif

	// store assigned control GPIO channel 1
	ESP32_S0_Definition->controlCH1GPIO = newControlCH1GPIO;

	// setup the GPIO and connect the matrix
        PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[newControlCH1GPIO], PIN_FUNC_GPIO);

        gpio_set_direction(newControlCH1GPIO, GPIO_MODE_INPUT);

        gpio_set_pull_mode(newControlCH1GPIO, GPIO_PULLUP_ONLY);

        gpio_matrix_in(newControlCH1GPIO
		,PCNT_CTRL_CH1_IN0_IDX + 4 * newUnit
		,0);
  }

  // block #6 store ESP32 counter configuration registers
  if (parsedKVInput->keysFoundBF & ( (1 << ESP32_S0_SET_CH1_LCTRL_MODE)
				   | (1 << ESP32_S0_SET_CH1_HCTRL_MODE)
				   | (1 << ESP32_S0_SET_CH1_POS_MODE)
				   | (1 << ESP32_S0_SET_CH1_NEG_MODE)
				   | (1 << ESP32_S0_SET_CH0_LCTRL_MODE)
				   | (1 << ESP32_S0_SET_CH0_HCTRL_MODE)
				   | (1 << ESP32_S0_SET_CH0_POS_MODE)
				   | (1 << ESP32_S0_SET_CH0_NEG_MODE)
				   | (1 << ESP32_S0_SET_THR_THRES1_EN)
				   | (1 << ESP32_S0_SET_THR_THRES0_EN)
				   | (1 << ESP32_S0_SET_THR_L_LIM_EN)
				   | (1 << ESP32_S0_SET_THR_H_LIM_EN)
				   | (1 << ESP32_S0_SET_THR_ZERO_EN)
				   | (1 << ESP32_S0_SET_FILTER_EN)
				   | (1 << ESP32_S0_SET_FILTER_THRES)
				   | (1 << ESP32_S0_SET_CNT_THRES1)
				   | (1 << ESP32_S0_SET_CNT_THRES0)
				   | (1 << ESP32_S0_SET_CNT_L_LIM)
				   | (1 << ESP32_S0_SET_CNT_H_LIM) ) ) {

	// store ESP32 counter configuration register
	memcpy(pS0_CNT_CONF_REG
		,&newS0_CNT_CONF_REG
		,sizeof(ESP32_S0_CNT_CONF_REG_t));

	# if ESP32_S0_DBG >= 5
	printf("|W B#06 ESP32_S0_CNT_CONF_REG_s addr=%p>"
		,pS0_CNT_CONF_REG);

	SCDEFn->HexDumpOutFn ("dump"
		,pS0_CNT_CONF_REG
		, sizeof(ESP32_S0_CNT_CONF_REG_t) );
	# endif
  }

  return false;

}



/**
 * ------------------------------------------------------------------------------------------------
 *  FName: ESP32_S0_SetAffectedReadings
 *  Desc: Do the readings update for this definition according to 'affectedReadings'
 *  Info: 
 *  Para: ESP32_S0_Definition_t *ESP32_S0_Definition -> Definition that should get the input
 *        uint64_t affectedReadings -> according to ...
 *  Rets: Bool -> TRUE = input parsed successful, FALSE = input parsed, but NOT successful, CANCELED
 * ------------------------------------------------------------------------------------------------
 */
bool ICACHE_FLASH_ATTR
ESP32_S0_SetAffectedReadings(ESP32_S0_Definition_t* ESP32_S0_Definition
	,uint64_t affectedReadings)
{

  // do we have updates?
  if (affectedReadings) {

  SCDEFn->readingsBeginUpdateFn((Common_Definition_t*) ESP32_S0_Definition);

  }

  // we have no updates
  else return false;

// -----------------------------------------------------------------------------------------------

  // temp for reading creation
  uint8_t *readingNameText;
  size_t readingNameTextLen;
  uint8_t *readingValueText;
  size_t readingValueTextLen;


//>Add Readings Bit 00 -----------------------------------------------------------------------------

  // add reading 'Alltime_Total_Tics' //att'
  if (affectedReadings & ESP32_S0_R_ATT) {

	readingNameTextLen = asprintf((char **) &readingNameText
		,"Alltime_Total_Tics");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%u"
		,ESP32_S0_Definition->ATTShiftBuf[0]);

	SCDEFn->readingsBulkUpdateFn((Common_Definition_t*) ESP32_S0_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

//	RespArgsWPos += os_sprintf(RespArgsWPos,
//		"&att=%u", SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]);



//>Add Readings Bit 01 -----------------------------------------------------------------------------

  // add reading 'Alltime_Total_Value' //atv'
  if (affectedReadings & ESP32_S0_R_ATV) {

	// calc helper ...
	float RB01_AlltimeTotalValue = ( ESP32_S0_Definition->ATTShiftBuf[0] *
		ESP32_S0_Definition->IB01_AlltimeTotalFactor);

	readingNameTextLen = asprintf((char **) &readingNameText
		,"Alltime_Total_Value");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%d.%03d"
		,(int) (RB01_AlltimeTotalValue)
		,(int) ( (RB01_AlltimeTotalValue - (int) RB01_AlltimeTotalValue) * 1000) );

	SCDEFn->readingsBulkUpdateFn((Common_Definition_t*) ESP32_S0_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);
  }

//	// calc helper ...
//	float RB01_AlltimeTotalValue = ( SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0] *
//		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalFactor);

//	RespArgsWPos += os_sprintf(RespArgsWPos
//		,"&atv=%d.%03d"
//		,(int)(RB01_AlltimeTotalValue)
//		,(int)((RB01_AlltimeTotalValue - (int)RB01_AlltimeTotalValue)*1000) );


//>Add Readings Bit 02 -----------------------------------------------------------------------------
/*
  if (affectedReadings & ESP32_S0_R_AV01_AV05_AV15) {

	int ThisS0CounterCaps = 0b11100000000000000000000000000000;
	// Add readings depending on CAPS ...

	// AV01 = AVerage last 01 Min (calculated), zwingt AVF = AVerageFactor und AVU  = AVerageUnit	
	if (ThisS0CounterCaps & 0b10000000000000000000000000000000)	// AV01 Caps avail?

		{

		RespArgsWPos += os_sprintf(RespArgsWPos // 'AV01' -> AVerage01min (calculated)
			,"&av01=%d.%03d"
			,(int)(SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].RB01_Average01Min)	
			,(int)((SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].RB01_Average01Min - 
			 (int)SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].RB01_Average01Min)*1000) );

