mattehicks/SCDE/components/ESP32_S0_Module/ESP32_S0_Module.c
  return true;
}
































/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_S0_CntProcessing1M
 *  Desc: Gets the impulses from the count hardware and calculates the values
 *  Info: Invoked by cmd-line 'Undefine ESP32_S0_Definition.common.Name'
 *  Para: ESP32_S0_Definition_t *ESP32_S0_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
//##################################################################################################
//### FName: S0_CntDetection (Called 100 times / Sec by timer!)
//###  Desc: Average Calculations + Detection of the S0 Counts at the GPIOs
//###  Para: NONE
//###  Rets: NONE
//##################################################################################################
void ICACHE_FLASH_ATTR
ESP32_S0_CntProcessing1M(ESP32_S0_Definition_t* ESP32_S0_Definition)
{

  // shift the ATT - last 15 minutes buffer
  for (int i = 14; i >=0 ; i--) {

	ESP32_S0_Definition->ATTShiftBuf[i+1] = 
		ESP32_S0_Definition->ATTShiftBuf[i];
  }

// -------------------------------------------------------------------------------------------------




  // build ptr to access hw-counter
  ESP32_S0_CNT_CNT_REG_t *pESP32_S0_CNT_CNT_REG =
	(ESP32_S0_CNT_CNT_REG_t*) 0x3FF57060;

  // add counts from hardware to att
  ESP32_S0_Definition->ATTShiftBuf[0] += 
	pESP32_S0_CNT_CNT_REG[ESP32_S0_Definition->unit].CNT_PULS_CNT;


  printf("|STATUS: Using counter-unit:%u, HW-Ctr:%d -> new ATT:%u, gpio:%u>"
	,ESP32_S0_Definition->unit
	,pESP32_S0_CNT_CNT_REG[ESP32_S0_Definition->unit].CNT_PULS_CNT
	,ESP32_S0_Definition->ATTShiftBuf[0]
	,gpio_get_level(22) ); //=att ?




  ESP32_S0_CNT_CONF_REG_t *pESP32_S0_CNT_CONF_REG = (ESP32_S0_CNT_CONF_REG_t*) 0x3FF570B0;

	SCDEFn->HexDumpOutFn ("verify:"
		,&pESP32_S0_CNT_CONF_REG[0]
		, 0x4);  //sizeof(0x80) ); //ESP32_S0_CNT_CONF_REG_t) );







  uint32_t *pX_REG =
	(uint32_t*) 0x3FF570B0;

  // config counter -> reset state to zero counter
  *pX_REG |= 1<<(ESP32_S0_Definition->unit * 2);
 for (int i = 140; i >=0 ; i--)
  // config counter -> NOT in reset state
  *pX_REG &= ~(1<<(ESP32_S0_Definition->unit * 2));
/*
 *pX_REG = 0b10;
 *pX_REG = 0b01;
 for (int i = 140; i >=0 ; i--)
 *pX_REG = 0;
*/



  // import the current counter value to ATTShiftBuf[0]
//  ESP32_S0_Definition->ATTShiftBuf[0] =
//	0;
  	

  // calculate average 01min
  ESP32_S0_Definition->RB01_Average01Min = 
	( (float) (ESP32_S0_Definition->ATTShiftBuf[0] - ESP32_S0_Definition->ATTShiftBuf[1])  *
	( (3600 / 01) / 60) * ESP32_S0_Definition->IB01_AverageFactor);

  // calculate average 05min
  ESP32_S0_Definition->RB01_Average05Min =
	( (float) (ESP32_S0_Definition->ATTShiftBuf[0] - ESP32_S0_Definition->ATTShiftBuf[5])  *
	( (3600 / 05) / 60) * ESP32_S0_Definition->IB01_AverageFactor);

  // calculate average 15min
  ESP32_S0_Definition->RB01_Average15Min =
	( (float) (ESP32_S0_Definition->ATTShiftBuf[0] - ESP32_S0_Definition->ATTShiftBuf[15]) *
	( (3600 / 15) / 60) * ESP32_S0_Definition->IB01_AverageFactor);

  // New Timestamp for this reading block
//  ESP32_S0_Definition->RB01_X_TiSt =
//	GetUniqueTIST();


// -------------------------------------------------------------------------------------------------

  #if ESP32_S0_DBG >= 5
  // 'ATT' -> Alltime Total Tics
  printf(",ATT=%u", ESP32_S0_Definition->ATTShiftBuf[0]);

  // calc helper ...
  float RB01_AlltimeTotalValue = ( ESP32_S0_Definition->ATTShiftBuf[0] *
	ESP32_S0_Definition->IB01_AlltimeTotalFactor);
  // 'ATV' -> Alltime Total Value
  printf(",ATV=%d.%03d"
	,(int)(RB01_AlltimeTotalValue)
	,(int)((RB01_AlltimeTotalValue - (int)RB01_AlltimeTotalValue)*1000) );

  // 'AV01' -> AVerage 01 min (calculated)
  printf(",AV01=%d.%03d"
	,(int)(ESP32_S0_Definition->RB01_Average01Min)	
	,(int)((ESP32_S0_Definition->RB01_Average01Min - 
	 (int)ESP32_S0_Definition->RB01_Average01Min)*1000) );

  // 'AV05' -> AVerage 05 min (calculated)
  printf(",AV05=%d.%03d"
	,(int)(ESP32_S0_Definition->RB01_Average05Min)	
	,(int)((ESP32_S0_Definition->RB01_Average05Min -
	 (int)ESP32_S0_Definition->RB01_Average05Min)*1000) );

  // 'AV15' -> AVerage 15 min (calculated)
  printf(",AV15=%d.%03d"
	,(int)(ESP32_S0_Definition->RB01_Average15Min)	
	,(int)((ESP32_S0_Definition->RB01_Average15Min -
	 (int)ESP32_S0_Definition->RB01_Average15Min)*1000) );	

  printf(",AVF=%d.%04d"
	,(int)(ESP32_S0_Definition->IB01_AverageFactor)	
	,(int)((ESP32_S0_Definition->IB01_AverageFactor -
	 (int)ESP32_S0_Definition->IB01_AverageFactor)*10000) );

  // 'AVU' -> Average Unit
  printf(",AVU=%s"
	,ESP32_S0_Definition->IB01_AverageUnit);

  // 'ATF' -> Alltime Total Factor
  printf(",ATF=%d.%04d"
	,(int)(ESP32_S0_Definition->IB01_AlltimeTotalFactor)	
	,(int)((ESP32_S0_Definition->IB01_AlltimeTotalFactor -
	 (int)ESP32_S0_Definition->IB01_AlltimeTotalFactor)*10000) );

  // 'ATU' -> Alltime Total Unit
  printf(",ATU=%s"
	,ESP32_S0_Definition->IB01_AlltimeTotalUnit);
  #endif

// -------------------------------------------------------------------------------------------------

}
		











